'''
Напишите программу, которая принимает текст и выводит два слова: наиболее часто встречающееся и самое длинное,
в идеале не использовать библиотечные функции.
'''

file_obj = open("LICENSE", "r")

for line in file_obj:
   print(line)




